[
   {
      "Beef Wellington": "400g flat cap mushrooms",
      "column1": " roughly chopped"
   },
   {
      "Beef Wellington": "sea salt and freshly ground black pepper"
   },
   {
      "Beef Wellington": "olive oil",
      "column1": " for cooking"
   },
   {
      "Beef Wellington": "750g piece of prime beef fillet"
   },
   {
      "Beef Wellington": "1-2tbsp whole wheat mustard"
   },
   {
      "Beef Wellington": "6-8 slices of Prosciutto"
   },
   {
      "Beef Wellington": "500g ready-made puff pastry"
   },
   {
      "Beef Wellington": "flour",
      "column1": " to dust"
   },
   {
      "Beef Wellington": "2 egg yolks",
      "column1": " beaten"
   },
   {
      "Beef Wellington": "Put the mushrooms into a food processor with some seasoning and pulse to a rough paste. Scrape the paste into a pan and cook over a high heat for about 10 mins",
      "column1": " tossing frequently",
      "column2": " to cook out the moisture from the mushrooms. Spread out on a plate to cool."
   },
   {
      "Beef Wellington": "Heat in a frying pan and add a little olive oil. Season the beef and sear in the hot pan for 30 secs only on each side. (You don't want to cook it at this stage",
      "column1": " just color it). Remove the beef from the pan and leave to cool",
      "column2": " then brush all over with the mustard."
   },
   {
      "Beef Wellington": "Lay a sheet of cling film on a work surface and arrange the Parma ham slices on it",
      "column1": " in slightly overlapping rows. With a palette knife",
      "column2": " spread the mushroom paste over the ham",
      "column3": " then place the seared beef fillet in the middle. Keeping a tight hold of the cling film from the edge",
      "column4": " neatly roll the Parma ham and mushrooms around the beef to form a tight barrel shape. Twist the ends of the cling film to secure. Chill for 15-20 mins to allow the beef to set and keep its shape."
   },
   {
      "Beef Wellington": "Roll out the puff pastry on a floured surface to a large rectangle",
      "column1": " the thickness of a £1 coin. Remove the cling film from the beef",
      "column2": " then lay in the center. Brush the surrounding pastry with egg yolk. Fold the ends over",
      "column3": " the wrap the pastry around the beef",
      "column4": " cutting off any excess. Turnover",
      "column5": " so the seam is underneath",
      "column6": " and place on a baking sheet. Brush over all the pastry with egg and chill for about 15 mins to let the pastry rest."
   },
   {
      "Beef Wellington": "Heat the oven to 200C",
      "column1": " 400F",
      "column2": " gas 6."
   },
   {
      "Beef Wellington": "Lightly score the pastry at 1cm intervals and glaze again with beaten egg yolk. Bake for 20 minutes",
      "column1": " then lower the oven setting to 180C",
      "column2": " 350F",
      "column3": " gas 4 and cook for another 15 mins. Allow to rest for 10-15 mins before slicing and serving with the side dishes of your choice. The beef should still be pink in the centre when you serve it."
   }
]