[
   {
      "Shepherd’s Pie": "1/2 to 2 pounds potatoes (about 3 large potatoes)",
      "column1": " peeled and quartered"
   },
   {
      "Shepherd’s Pie": "8 Tablespoons (1 stick) butter"
   },
   {
      "Shepherd’s Pie": "1 medium onion",
      "column1": " chopped (about 1 1/2 cups)"
   },
   {
      "Shepherd’s Pie": "1-2 cups vegetables—diced carrots",
      "column1": " corn",
      "column2": " peas"
   },
   {
      "Shepherd’s Pie": "1 1/2 lbs ground round beef"
   },
   {
      "Shepherd’s Pie": "1/2 cup beef broth"
   },
   {
      "Shepherd’s Pie": "1 teaspoon Worcestershire sauce"
   },
   {
      "Shepherd’s Pie": "Salt",
      "column1": " pepper",
      "column2": " other seasonings of choice"
   },
   {
      "Shepherd’s Pie": "1 Boil the potatoes: Place the peeled and quartered potatoes in medium sized pot. Cover with at least an inch of cold water. Add a teaspoon of salt. Bring to a boil",
      "column1": " reduce to a simmer",
      "column2": " and cook until tender (about 20 minutes."
   },
   {
      "Shepherd’s Pie": "2 Sauté vegetables: While the potatoes are cooking",
      "column1": " melt 4 tablespoons of the butter in a large sauté pan on medium heat. Add the chopped onions and cook until tender",
      "column2": " about 6 to 10 minutes."
   },
   {
      "Shepherd’s Pie": "If you are including vegetables",
      "column1": " add them according to their cooking time. Carrots should be cooked with the onions",
      "column2": " because they take as long to cook as the onions do."
   },
   {
      "Shepherd’s Pie": "If you are including peas or corn",
      "column1": " add them toward the end of the cooking of the onions",
      "column2": " or after the meat starts to cook",
      "column3": " as they take very little cooking time."
   },
   {
      "Shepherd’s Pie": "3 Add the ground beef",
      "column1": " then Worcestershire sauce and broth: Add ground beef to the pan with the onions and vegetables. Cook until no longer pink. Season with salt and pepper."
   },
   {
      "Shepherd’s Pie": "Add the Worcestershire sauce and beef broth. Bring the broth to a simmer and reduce heat to low. Cook uncovered for 10 minutes",
      "column1": " adding more beef broth if necessary to keep the meat from drying out."
   },
   {
      "Shepherd’s Pie": "4 Mash the cooked potatoes: When the potatoes are done cooking (a fork can easily pierce)",
      "column1": " remove them from the pot and place them in a bowl with the remaining 4 Tbsp of butter. Mash with a fork or potato masher",
      "column2": " and season with salt and pepper to taste."
   },
   {
      "Shepherd’s Pie": "5 Layer the meat mixture and mashed potatoes in a casserole dish: Preheat oven to 400°F. Spread the beef",
      "column1": " onions",
      "column2": " and vegetables (if using) in an even layer in a large baking dish (8x13 casserole)."
   },
   {},
   {
      "Shepherd’s Pie": "Spread the mashed potatoes over the top of the ground beef. Rough up the surface of the mashed potatoes with a fork so there are peaks that will get well browned. You can even use a fork to make creative designs in the mashed potatoes."
   },
   {
      "Shepherd’s Pie": "6 Bake in oven: Place in a 400°F oven and cook until browned and bubbling",
      "column1": " about 30 minutes. If necessary",
      "column2": " broil for the last few minutes to help the surface of the mashed potatoes brown."
   },
   {
      "Shepherd’s Pie": "Sprinkle grated cheddar cheese over the top of the mashed potatoes before baking."